# Дано целое число. Вывести его строку описание вида «отрицательное чет- ное число»,
# «нулевое число», «положительное нечетное число» и т. д.

# a = int(input(" a = "))
# if a % 2 <= 0:
#     print("отрицательное чет- ное число a ")
# else:
#     print("отрицательное не чет- ное число a ")
# if a % 2 == 1:
#     print("«положительное нечетное число a ")
# else:
#     print("Додатне четное  число a ")
# else:
# print("«нулевое число a")

# a = int(input( " a = "))
# if a % 2 <= 0:
#     print("отрицательное чет- ное число a ")
# elif a % 2 == 1 and a < 0:
#     print("отрицательное не чет- ное число a ")
# elif a % 2 == 1:
#     print("«положительное нечетное число a ")
# else:
#     print("Додатне четное  число a ")
# else:
#     print("«нулевое число a")



# Дан номер месяца целое число в диапазоне 1-12 (1 январь, 2- (1 февраль и т. д.).
# Вывести название соответствующего времени года («зи- ма», «весна», «лето», «осень»).

# month= int(input( " month = "))
# if 1 <= month <= 2 or month == 12:
#     print(" Зима ")
# elif 3 <= month <= 5:
#     print(" Весна ")
# elif 6 <= month  or month <= 11:
#     print(" Осінь  ")
# else:
#     print(" Літо ")

# Определить, останется ли в клеёнке более № дырок если во время обеда и К раз проткнуть её
# вилкой с 2 отломанными зубчиками и 11раз целой
# По вилкой, у которой 5 зубчиков.

# v1 = int(input(" 1 = "))
# v2 = int(input(" 2 = "))
# k = int(input(" k = "))
# n = int(input(" n = "))
# v1 = k * 2
# print(v1)
# v2 = 11 * 5
# print(v2)
# n = (v1 + v2)
# if v1 + v2 > n:
#     print (" В кліенке залишиться більше n ")
# elif v1 + v2 <= n:
#     print(" В кліенке залищиться меньше n ")
# else:
#     print(" Рівно n дирок ")








