# while condition:
#     oper1
#     oper2
#

# a = 1
# while a <= 5:
#     print(a, end=' ')
#     a += 1


# a = 13
# b = 8
#
# if b > a:
#     while a <= b:
#         print(a, end=' ')
#         a += 1
# else:
#     while a >= b:
#         print(a, end=' ')
#         a -= 1


# a = 10
# b = 3
# k = 0
# while a >= b:
#     a -= b
#     k += 1
# print(a, k)


# Дано целое число N (> 0). Если оно является степенью числа 3, то вы-
# вести True, если не является — вывести False.

# n = 27
# k = 1
# while k < n:
#     k *= 3
# print(k == n)

# Дано целое число N (> 0), являющееся некоторой степенью числа 2:
# N = 2**K. Найти целое число K — показатель этой степени.

# n = 2048
# k = 1
# s = 0
# while n > k:
#     k *= 2
#     s += 1
# print(s)


# Дано целое число N (> 0). Найти наибольшее целое число K, квадрат
# которого не превосходит N: K**2 ≤ N. Функцию извлечения квадратного кор-
# ня не использовать.

# n = 20
# k = 1
# while k*k <= n:
#     k += 1
# print(k-1)

# n = 3751
# s = 0
# while n > 0:
#     r = n % 10
#     s += r
#     n //= 10
# print(s)

# n = 15
# i = 1
# s = 0
# while i <= n:
#     m = 11 * i
#     s += m
#     i += 1
#     print(m, end= ' + ')
# print()
# print(s)


# n = 3751
# s = 0
# while n > 0:
#     s += 1
#     n //= 10
# print(s)