# x = int(input("x = "))
# y = int(input("y = "))
# x1 = int(input("x1 = "))
# y1 = int(input("y1 = "))
# res = (x + y) % 2 == (x1 + y1) % 2
#
#
# res = x == x1 or y == y1

# if condition:
#     oper1
#     oper2
# else:
#     oper3
#     oper4
#     oper5


# a = int(input("a = "))
# if a > 0:
#     print("Positive")
# elif a == 0:
#     print("0")
# else:
#     print("Negative")


# Дано целое число. Если оно является положительным, то прибавить к не-
# му 1; в противном случае не изменять его. Вывести полученное число.

# a = int(input("a = "))
# if a > 0:
#     a = a + 1
# print(a)


# Дано целое число. Если оно является положительным, то прибавить к не-
# му 1; в противном случае вычесть из него 2. Вывести полученное число.

# a = int(input("a = "))
# if a > 0:
#     a += 1
# elif a < 0:
#     a -= 2
# else:
#     a = 10
#
# print(a)

# Дано целое число. Если оно является положительным, то прибавить к не-
# му 1; если отрицательным, то вычесть из него 2; если нулевым, то заме-
# нить его на 10. Вывести полученное число.


# Даны чотри целых числа. Найти количество положительных чисел в исход-
# ном наборе.

# res = 0
# if a > 0:
#     res += 1
# if b > 0:
#     res += 1
# if c > 0:
#     res += 1
# if d > 0:
#     res += 1


# Даны два числа. Вывести порядковый номер меньшего из них.
# x = int(input(" :"))
# y = int(input(" :"))
# if x > y:
#     print("2")
# elif x < y:
#     print("1")
# else:
#     print("=")

# Даны три числа. Найти наибольше из них.

# if a > b > c:
#     print(a)
# elif b > c:
#     print(b)
# else:
#     print(c)