# n1 = int(input("Forward = "))
# n2 = int(input("Backward = "))
# n3 = int(input("In between = "))
# d = 0
# while n3 > 0:
#     n3 -= n1
#     if n3 > 0:
#         n3 += n2
#     d += 1
# print(d)


# Спортсмен-лыжник начал тренировки, пробежав в первый день 10 км.
# Каждый следующий день он увеличивал длину пробега на P процентов от
# пробега предыдущего дня (P — вещественное, 0 <= P <= 50). По данному P
# определить, после какого дня суммарный пробег лыжника за все дни пре-
# высит 200 км, и вывести найденное количество дней K (целое) и суммар-
# ный пробег S (вещественное число).


# d = 10
# s = 10
# k = 1
# p = int(input("p = "))
# while s <= 200:
#     d1 = d * p / 100 + d
#     s += d1
#     k += 1
#     d = d1
#
# print(k, s)


# n = 10000
# count = 0
# while n <= 99999:
#     if n % 9 == 0:
#         k5 = 0
#         m = n
#         while m > 0:
#             r = m % 10
#             if r == 5:
#                 k5 += 1
#             m //= 10
#         if k5 == 3:
#             print(n)
#             count += 1
#     n += 1
#
# print(count)


# n = int(input("n = "))
#
# m = 1
# while m <= 10:
#     print(f"{n} * {m} = {m*n}")
#     m += 1


# 1 1 2 3 5 8 13 21 34 55 .......

# f1 = 1
# f2 = 1
# k = 2
# n = int(input("n = "))
# while k < n:
#     fn = f1 + f2
#     f1 = f2
#     f2 = fn
#     k += 1
#
# print(fn)


# f1 = 1
# f2 = 1
# k = 2
# n = int(input("n = "))
# fn = 1
# while fn != n:
#     fn = f1 + f2
#     f1 = f2
#     f2 = fn
#     k += 1
# print(k)