# for i in range(100):
#     print(i)


# Дано вещественное число — цена 1 кг конфет. Вывести стоимость 1,
# 2, ..., 10 кг конфет.

# p = 3.25
# for m in range(1, 11):
#     print(f"{m}kg = {p * m} grn")


# Дано вещественное число — цена 1 кг конфет. Вывести стоимость 0.1,
# 0.2, ..., 1 кг конфет.

# p = 3.25
# for m in range(1, 11):
#     print(f"{m/10}kg = {p * m/10} grn")


# Дано вещественное число — цена 1 кг конфет. Вывести стоимость 1.2,
# 1.4, ..., 2 кг конфет.

# p = 3.25
# for m in range(2, 11, 2):
#     print(f"{1+m/10}kg = {p * (1+m/10)} grn")

# Даны два целых числа A и B (A < B). Найти сумму всех целых чисел от A
# до B включительно.

# a = 1
# b = 10
# s = 0
# for m in range(a, b+1):
#     s += m
# print(s)


# Дано целое число N (> 0). Найти значение выражения
# 1.1 +(– 1.2) + 1.3 +(–1.4 )...
# (N слагаемых, знаки чередуются). Условный оператор не использовать.

# n = 9
# s = 0
# for i in range(1, n+1):
#     p = (-1)**(i+1) * (1+i/10)
#     s += p
#     print(p, end=' ')
#
# print(s)


# n = int(input("Скількі є магазинів : "))
# s = 0
# for m in range(1, n+1):
#     h = int(input(f"Скількі є хол-ків в {m}-му магазині : "))
#     s += h
# print(s)

# n = int(input("Скількі є шкіл : "))
# s = 0
# for m in range(1, n+1):
#     h = int(input(f"Скількі є учнів в {m}-ій школі : "))
#     if h > 1000:
#         s += 1
# print(s)


# 000001 - 999999
# s = 0
# for n in range(1, 1000000):
#     n1 = n % 10
#     n2 = n // 10 % 10
#     n3 = n // 100 % 10
#     n4 = n // 1000 % 10
#     n5 = n // 10000 % 10
#     n6 = n // 100000
#     if n1 + n2 + n3 == n4 + n5 + n6:
#         s += 1
# print(s)


# 00:00:00

c = 0
for h in range(24):
    for m in range(60):
        for s in range(60):
            h1 = h // 10
            h2 = h % 10
            m1 = m // 10
            m2 = m % 10
            s1 = s // 10
            s2 = s % 10
            if h1 == s2 and h2 == s1 and m1 == m2:
                c += 1
                print(f"{h1}{h2}:{m1}{m2}:{s1}{s2}")
print(c)


# Даны целые положительные числа A и B (A < B). Вывести все целые
# числа от A до B включительно; при этом каждое число должно выводиться
# столько раз, каково его значение (например, число 3 выводится 3 раза).
# 2 6
#
# 22
# 333
# 4444
# 55555
# 666666

a = 2
b = 6
for i in range(a, b+1):
    for j in range(i):
        print(i, end=' ')
    print()