# Дано трехзначное число. Проверить истинность высказывания: «Цифры данного числа образуют возрастающую или убы
# вающую после- довательность».
# n = int(input( " n = "))
# a = n // 100
# n1 = ( n // 10) % 10
# n2 =  n  % 10
# print( n )


# Даны числа A, B, C (число A не равно 0). Рассмотрев дискриминант D = B*B– 4·A·C, проверить истинность высказывания: «Квадратное уравне- ние A·x2+ B·x + C = 0 имеет вещественные корни».
# a = int(input(" a = "))
# b = int(input(" b = "))
# c = int(input(" c = "))
# a != 0
# d = b*b - 4*a*c
# if d <= 0:
#      print("No")
#
# # a = a * x^2 + B * x + C = 0
# print(d)

# Даны числа x, y. Проверить истинность высказывания: «Точка с ко- ординатами (x, y) лежит во второй или третьей координатной четверти».
# x = int(input( " x = "))
# y = int(input( " y = "))
# ( x < 0  and y > 0 ) or ( x < 0 and y < 0 )
# y != 0
#
# print(   "   Точка знаходиться в вторій кординтній чверті " )
# print( " Точка не знаходиться в другій координатній чверті  ")
