# Користувач з клавіатури вводить елементи списку цілих.
# Необхідно порахувати суму всіх елементів та їхнє середньоарифметичне. Результати вивести на екран.
import random
#
# l = 10
# nums = [random.randint(1,10) for i in range(l)]
# print(nums)
# print(sum(nums))
# print(sum(nums) // l)

# Користувач з клавіатури вводить елементи списку цілих і деяке число.
# Необхідно порахувати скільки разів дане число присутнє у списку. Результат вивести на екран.

# a = 5
# l = 10
# nums = [random.randint(1,10) for i in range(l)]
# print(nums)
# res = 0
# for  el in nums:
#     if el == a:
#         res += 1
# print(res)


# Завдання 3
# Користувач з клавіатури вводить список чисел.
# Необхідно знайти суму всіх додатних чисел у списку. Результат вивести на екран.


# l = 10
# nums = [random.randint(-50,50) for i in range(l)]
# print(nums)
# res = 0
# for el in nums:
#     if el >= 0:
#         res += el
# print(res)


# Завдання 4
# Користувач з клавіатури вводить список цілих чисел.
# Необхідно визначити індекси всіх парних чисел у списку. Результат вивести на екран.

# l = 10
# nums = [random.randint(1,50) for i in range(l)]
# print(nums)
# for i in range(len(nums)):
#     if nums[i] % 2 == 0:
#         print(i)
#         even.append(i)
# print(even)

# Завдання 6
# Користувач з клавіатури вводить список цілих чисел.
# Необхідно видалити зі списку всі елементи, що повторюються, залишивши тільки унікальні.
# Результат вивести на екран.





