# Дано число A (> 1). Вывести наибольшее из целых чисел K, для кото-
# рых сумма 1 + 1/2 + ... + 1/K будет меньше A, и саму эту сумму.
# a = 15
# k = 1
# s = 0
# while s + 1  / k < a:
#     s += 1 / k
#     k += 1
#     k -= 1
#
# print(k)
# print(s)

# Дано целое число N (> 1). Вывести наибольшее из целых чисел K, для
# которых сумма 1 + 2 + ... + K будет меньше или равна N, и саму эту сумму.

# n = 20
# K = 1
# S = 0
#
# while S + K <= n:
#     S += K
#     K += 1
# K -= 1
# print(K)
# print(S)