# Написати рекурсивну функцію знаходження найбільшого спільного дільника двох цілих чисел.

def nsd(a,b):
    if b == 0:
        return a
    return nsd(b,a % b)



print(nsd(48,18))
#
# Напишіть рекурсивну функцію, яка обчислює суму цифр заданого числа.
# Приклад:
# Введення: 123
# Виведення: 6 (оскільки 1+2+3=6).


def sum_cifr(n):
    if n == 0:
        return 0
    return (n % 10) + sum_cifr(n // 10)

print(sum_cifr(123))



# Завдання 3
# Напишіть рекурсивну функцію, яка перевіряє, чи є заданий список симетричним.
# Симетричний список — це список, у якому елементи зліва направо і справа наліво збігаються.
# Приклад:
# Введення: [1,2,3,2,1]
# Висновок: "Список симетричний"


def symetr(n):
    if len(n) <= 1:
        return True
    if n[0] != n[-1]:
        return False

    return symetr(n[1:-1])


spysok = [1,2,3,2,1]
if symetr(spysok):
    print("Список симетричний")
else:
    print("Список не симетричний")

